[
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "Winter, spring, summer, fall… you might think there are four seasons in Canada. But there’s one more to add: tax season.\n\nFor personal taxes, or if you run a business that’s not a corporation, the income tax year matches the calendar year: January 1 to December 31. Then, the following spring, you have to do what’s called “filing your taxes” or “doing your tax return.” This means filling out an income tax return and sending it to the Canada Revenue Agency, or CRA."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "Personal income tax deadline: The deadline to file personal taxes is April 30. So, for tax year 2023, you’ll have to file by April 30, 2024.\nSelf-employment tax deadline: If you or your spouse or common-law partner have self-employment income, your filing deadline is a bit later, on June 15. \nDeadline for taxes owed: If you owe income tax to the government, you still have to pay the amount by April 30, even if you don’t file your taxes until June 15."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "Weekend blackout: If April 30 or June 15 are a Saturday or Sunday, the deadline gets pushed to the following Monday.\nNewcomer tax filing date: When should newcomers file their taxes for the first time? Usually, on the filing deadline for the year when you become a resident for tax purposes. For instance, if you moved to Canada in July 2023, you would file your first tax return by April 30, 2024. You may also be able to apply for some benefits and credits earlier than that."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "Note: If you file your return later than the due date, you may have to pay penalties and interest on any amounts owing."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "What are the advantages of filing a tax return?\nNot sure if you need to file a tax return? Even if it’s not required (like if you have a zero-income tax return) or you think you could leave it until later, there are still some very good reasons to file.\n\nFor instance: \n\nTo receive a tax refund. A tax refund happens when the government sends you back all or part of the taxes you’ve already paid, because either you didn’t earn enough income during the year or you paid too much tax.\nTo avoid penalties on taxes owed. As a resident of Canada, you pay income tax on all worldwide income earned while a resident of Canada, both foreign and domestic sources. Be sure to report all sources of income and file by the deadline to avoid penalties and interest charges from the CRA. \nTo set up your CRA My Account. Once you have filed your tax return for the first time, you’ll be able to use that information to complete your registration and access CRA’s My Account, the online system that helps you track and maintain your tax information as well as communicate with the CRA.\nTo take advantage of benefits. If you’re 19 or older, you may also be eligible for a larger refund through refundable credits such as the GST/HST credit, Canada child benefit (CCB), or Canada Worker Benefit. Even if you did not receive income during the year, it’s a good idea to file a return so that the CRA can determine whether you’re eligible for any tax benefits for newcomers.\nTo find out your residency status. What if you’re an international student studying in Canada? Well, you may have to file an income tax return. Whether you have to file or pay income tax in Canada depends on your residency status and whether you earn income in Canada. So it’s a good idea to figure out your residency status and how that affects whether (and when) you have to file taxes.\n"
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "What is the impact of residency on taxes?\nAccording to the CRA, you are considered to be a resident for tax purposes when you establish significant residential ties in Canada. These ties most often happen on the date when you arrive in Canada. Examples of significant residential ties include:\n\nEstablishing a home in Canada\nHaving a spouse or common-law partner in Canada\nHaving dependents (such as children) in Canada\nThe criteria the CRA uses to determine whether you are a resident for tax purposes are not the same as those used for permanent residence status or Canadian citizenship.\n\nIf you are considered to be a resident of Canada or a deemed resident of Canada, you should file an income tax return for either the entire tax year or the part of the tax year you’ve lived in Canada. \n\nIf you are not sure about the exact date when you officially became a resident, the CRA offers the NR74 Determination of Residency Status (Entering Canada) form, which you can complete and submit. The CRA then issues a decision letter with a date they consider you became a resident of Canada. "
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "Do refugees pay taxes in Canada?\nYes, refugees pay taxes in Canada. As a refugee, the amount of income tax you pay depends on how much money you make, as well as where you live and any deductions or credits you might have. "
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "How do I file my taxes for the first time? \nAs a new Canadian, there are two ways to file your own taxes. \n\nOnline: A certified tax preparer can submit your tax return online on your behalf; or, you can use NETFILE (that is, you prepare your return yourself using a certified tax software, such as TurboTax).\nMail: You can print and mail your first income tax return to the CRA."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "What information do I need to file my return?\nGenerally speaking, to do your taxes, you’ll have to provide basic personal information, such as your full legal name, your address, and all income from the previous year (the easy stuff).\n\nOther important things to note: \n\nMake sure you have applied for, and received, your Social Insurance Number (SIN), which is used to identify you for income tax and benefits.\nIf you are already employed in Canada, you’ll receive a slip from each employer you worked for during that tax year. The slip is called a T4 – Statement of Remuneration Paid; you should receive it from your employer by the end of February.\nIf you recently arrived in Canada, you’ll need to include information about your income earned before arriving.\nIf you received employment income from outside Canada after the day you relocated, you’ll need those numbers as well.\nIf you have foreign assets over $100,000, you’ll need to report them on Form T1135 on your tax return.\nIf you have dependents, such as a spouse, children, or elderly parents, you’ll have to provide all of their details, too.\nCredits and deductions you can claim depend on your own individual tax situation. For example, if you have child care expenses, you may be eligible to claim those on your return. If you paid medical expenses for yourself, your spouse, or your children, you may be able to claim those as well. (Make sure you have official receipts!)\nIf you’re bringing any kind of assets to Canada, you will need to include details and market value on the day you arrive. Your capital gains or losses will be calculated based on this amount, if and when you sell them.\nFor Québec residents, you must file a tax return with Revenu Québec as well. (Québec is the only province in Canada where you need to file two tax returns.)"
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "What are the steps for filing a tax return?\nDon’t stress—it might seem like a lot, but filing taxes by yourself isn’t that hard. It all comes down to these four steps:\n\nGather all the documents and information you need, as listed above. \nChoose how you’re going to file your taxes and get prepared. If you want to mail your tax return, request a copy of the paper filing package from the CRA. If you want to file your taxes online, create an account with a tax preparation tool like TurboTax. If you’d prefer to hire an accountant, ask for referrals for someone in your community. (As a newcomer, you may be eligible for free tax help—the CRA has information on how to find a free tax clinic.)\nWork through your tax return, filling out the forms step by step. If you’re working on paper, be sure to double-check your math! If you’re doing your taxes online or with an accountant, make sure they’ve included all your income, deductions, credits, and expenses.\nSend in your tax return by the deadline. Once the CRA has processed your return, you’ll receive a Notice of Assessment, which outlines their conclusions and gives you important information on your tax situation; it also lets you know whether you owe money or will receive a refund. Keep this document somewhere safe—you’ll need it again in the future."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "How do I declare foreign income?\nAny income you earned before you arrived in Canada is not subject to Canadian taxes. However, once you are a Canadian resident, for tax purposes you have to declare all income from anywhere in the world on your tax return.\n\nIf you declare foreign income on a Canadian tax return:\n\nIndicate the country the funds came from.\nDeclare the full amount of any income (that is, the amount before foreign taxes were withheld).\nIn some cases, income you earned from a country other than Canada may be exempt from tax in Canada due to a tax treaty. But you must still report the income on your tax return. You can deduct the exempt part on line 25600 of the form."
  },
  {
    "source_url": "https://turbotax.intuit.ca/tips/taxes-for-new-canadians-step-by-step-guide-to-filing-your-tax-return-14177",
    "description": "How do I declare foreign property?\nWhen you’re a Canadian resident, you have to report any foreign property you own that has an adjusted cost base above $100,000 at any period during the year. This includes bank accounts, stocks, bonds, and real estate. You make the declaration on Form T1135, Foreign Income Verification Statement.\n\n"
  },
  {
    "source_url": "https://startright.scotiabank.com/file-your-first-tax-return.html",
    "description": "Are you a resident of Canada?\nIf you're a resident of Canada for income tax purposes, you'll need to file tax returns for any tax year in which you have to pay taxes.\n\nFederal and provincial personal income tax returns in Canada are administrated by the Canada Revenue Agency (CRA). If you are a resident of Quebec, you need to file a separate provincial personal tax return.\n\nYou become a resident of Canada for income tax purposes when you establish significant residential ties in Canada. These include if you have:\n\nA home in Canada\nA spouse or common-law partner in Canada\nDependents in Canada\nAccording to the CRA, you usually establish residential ties on the date you arrive in Canada."
  },
  {
    "source_url": "https://startright.scotiabank.com/file-your-first-tax-return.html",
    "description": "Do you have to file a tax return?\nYou may have to file a personal income tax return even if you've only been in Canada for part of the year.\n\nFile a return if you:\n\nhave to pay tax for the year\nwant to claim a refund\nwant to get benefit and credit payments"
  },
  {
    "source_url": "https://startright.scotiabank.com/file-your-first-tax-return.html",
    "description": "What you need to file a tax return\nHere's what you'll need to file your tax return. First, you’ll need to provide basic information, such as your name and address. Among others, you will also need the following information.\n\nSocial Insurance Number (SIN)\nA SIN is a nine-digit number that's used to access government programs and benefits. Your SIN is not the same as a temporary tax number (TTN) or an individual tax number (ITN).\n\nInformation slips\nIf you are employed in Canada at any time during the tax year, your employer will issue you a T4 slip. This slip outlines your total renumeration and deductions for the year (such as EI, CPP and income tax withheld).\n\nIf you have investment income, you may receive a T5 slip and or a T3 slip.\n\nBusiness receipts\nIf you are self-employed, you will need to keep business receipts and invoices to accurately report your income and claim deductions. It is important to keep these receipts in case CRA has any follow-up questions.\n\nChildcare receipts\nThese are receipts for childcare expenses incurred to have someone look after an eligible child so that you can work or study.\n\nDependant's details\nIf you have dependents, such as a spouse, children, or elderly parents, you'll need to provide information details about them in your tax return. You may be eligible for certain tax credits.\n\n"
  },
  {
    "source_url": "https://startright.scotiabank.com/file-your-first-tax-return.html",
    "description": "If you owned property before your arrival in Canada\nThere are rules that apply to property you owned before you immigrated to Canada, such as shares, jewelry or artwork. Under these rules, this property is deemed to have been sold and reacquired by you for their fair market value on the date you became a Canadian resident.\n\nYou'll need to keep a record of this fair market value, because you'll need this information to determine any taxable gain or loss if you dispose of the property in the future."
  },
  {
    "source_url": "https://startright.scotiabank.com/file-your-first-tax-return.html",
    "description": "How to file your tax return\nThere are three different ways to file your return:\n\nEFILE. If you had an accountant or tax preparer prepare your tax return, they'll likely file your return electronically using EFILE.\nNETFILE. Certain brands of tax software allow you to file your return electronically using NETFILE.\nMail. You can mail a paper return to the CRA. You will be deemed to have filed the return on the postmarked date.\nIf you need help completing and filing your return, meet with a tax professional or tax filer. You may also be able to get assistance and tax tips from free tax clinics run by the Community Volunteer Income Tax Program (CVITP)."
  }
]